state_machine.dot
digraph G {
  rankdir="LR";
  node [shape=box, style=rounded];
  "page_academy";
  "page_archives";
  "page_battle_pass";
  "page_build";
  "page_campaign";
  "page_campaign_menu";
  "page_channel";
  "page_coalition";
  "page_commission";
  "page_daily";
  "page_dock";
  "page_dorm";
  "page_dormmenu";
  "page_event";
  "page_event_list";
  "page_exercise";
  "page_fleet";
  "page_game_room";
  "page_guild";
  "page_hospital";
  "page_mail";
  "page_main";
  "page_main_white";
  "page_meowfficer";
  "page_meta";
  "page_mission";
  "page_munitions";
  "page_os";
  "page_private_quarters";
  "page_raid";
  "page_research";
  "page_reshmenu";
  "page_reward";
  "page_rpg_city";
  "page_rpg_stage";
  "page_rpg_story";
  "page_shipyard";
  "page_shop";
  "page_sp";
  "page_storage";
  "page_supply_pack";
  "page_tactical";
  "page_unknown";
  "page_main" -> "page_campaign_menu";
  "page_main" -> "page_fleet";
  "page_campaign_menu" -> "page_campaign";
  "page_campaign_menu" -> "page_main";
  "page_campaign" -> "page_main";
  "page_campaign" -> "page_campaign_menu";
  "page_fleet" -> "page_main";
  "page_main_white" -> "page_campaign_menu";
  "page_main_white" -> "page_fleet";
  "page_unknown" -> "page_main";
  "page_exercise" -> "page_main";
  "page_exercise" -> "page_campaign_menu";
  "page_campaign_menu" -> "page_exercise";
  "page_daily" -> "page_main";
  "page_daily" -> "page_campaign_menu";
  "page_campaign_menu" -> "page_daily";
  "page_event" -> "page_main";
  "page_event" -> "page_campaign";
  "page_campaign_menu" -> "page_event";
  "page_campaign" -> "page_event";
  "page_sp" -> "page_main";
  "page_sp" -> "page_campaign";
  "page_campaign_menu" -> "page_sp";
  "page_campaign" -> "page_sp";
  "page_coalition" -> "page_main";
  "page_coalition" -> "page_campaign";
  "page_campaign_menu" -> "page_coalition";
  "page_os" -> "page_main";
  "page_campaign_menu" -> "page_os";
  "page_archives" -> "page_campaign_menu";
  "page_campaign_menu" -> "page_archives";
  "page_reward" -> "page_main";
  "page_main" -> "page_reward";
  "page_main_white" -> "page_reward";
  "page_mission" -> "page_main";
  "page_main" -> "page_mission";
  "page_main_white" -> "page_mission";
  "page_guild" -> "page_main";
  "page_main" -> "page_guild";
  "page_main_white" -> "page_guild";
  "page_commission" -> "page_main";
  "page_commission" -> "page_reward";
  "page_reward" -> "page_commission";
  "page_tactical" -> "page_main";
  "page_tactical" -> "page_reward";
  "page_reward" -> "page_tactical";
  "page_battle_pass" -> "page_main";
  "page_reward" -> "page_battle_pass";
  "page_event_list" -> "page_main";
  "page_main" -> "page_event_list";
  "page_main_white" -> "page_event_list";
  "page_raid" -> "page_main";
  "page_main" -> "page_raid";
  "page_main_white" -> "page_raid";
  "page_dock" -> "page_main";
  "page_main" -> "page_dock";
  "page_main_white" -> "page_dock";
  "page_research" -> "page_main";
  "page_shipyard" -> "page_main";
  "page_meta" -> "page_main";
  "page_storage" -> "page_main";
  "page_main" -> "page_storage";
  "page_main_white" -> "page_storage";
  "page_reshmenu" -> "page_research";
  "page_reshmenu" -> "page_shipyard";
  "page_reshmenu" -> "page_meta";
  "page_reshmenu" -> "page_main";
  "page_main" -> "page_reshmenu";
  "page_main_white" -> "page_reshmenu";
  "page_dormmenu" -> "page_main";
  "page_main" -> "page_dormmenu";
  "page_main_white" -> "page_dormmenu";
  "page_dormmenu" -> "page_dorm";
  "page_dorm" -> "page_main";
  "page_dormmenu" -> "page_meowfficer";
  "page_meowfficer" -> "page_main";
  "page_dormmenu" -> "page_academy";
  "page_academy" -> "page_main";
  "page_dormmenu" -> "page_private_quarters";
  "page_private_quarters" -> "page_main";
  "page_academy" -> "page_game_room";
  "page_game_room" -> "page_main";
  "page_shop" -> "page_main";
  "page_main" -> "page_shop";
  "page_main_white" -> "page_shop";
  "page_academy" -> "page_munitions";
  "page_munitions" -> "page_main";
  "page_shop" -> "page_supply_pack";
  "page_supply_pack" -> "page_main";
  "page_build" -> "page_main";
  "page_main" -> "page_build";
  "page_main_white" -> "page_build";
  "page_mail" -> "page_main";
  "page_main_white" -> "page_mail";
  "page_main" -> "page_mail";
  "page_channel" -> "page_main";
  "page_rpg_stage" -> "page_rpg_story";
  "page_rpg_stage" -> "page_main";
  "page_rpg_story" -> "page_rpg_stage";
  "page_rpg_story" -> "page_main";
  "page_campaign_menu" -> "page_rpg_stage";
  "page_rpg_city" -> "page_rpg_stage";
  "page_rpg_city" -> "page_main";
  "page_hospital" -> "page_main";
  "page_campaign_menu" -> "page_hospital";
}
